{"1": ["Many BTC cult members were triggered by this tweet, and they call it a lie.\\n\\nCan somebody please show the internet????>_", "After months of anticipation, the Substratum team is excited to finally announce we will be the first ERC20 token t????>_", "Bitcoin Cash is building all the tools to make it useful as cash for the entire world.\\nJoin us!????>_", "Roger Ver: \"Here is what I think makes Bitcoin Bitcoin, and why I think Bitcoin Cash is Bitcoin\" @rogerkver", "Why is Bitcoin Cash perfect for micropayments?", "Whenever you read the comments section of an article, tweet, or Reddit post about #BitcoinCash, just remember that????>_", "What is Verge?", "Pornhub Partners With Verge Cryptocurrency, Shifting The Future Of Porn Payments via @forbes", "Pornhub now allows payments from one specific cryptocurrency! \\n via @mashable", "Verge XVG Now 2nd Most Traded Crypto on Binance! via @cointhud $XVG #vergeFAM", "Wow! Verge (XVG) Up 100% in April, Whats Going On?", "Roger Ver nailed it in this Bloomberg interview. I can't understand how anyone thinks the guy is a villain, he's be????>_", "RT @XVGGAUDI: Verge's update was a success! \\nThe blockchain is moving perfectly on all algorithms\\n\\n@vergecurrency #Vergecurrency #XVG $xvg????>_", "Magic Internet Money is more fun than Magic Internet Store of Value.\\nBCH > BTC", "An announcement regarding LitePay.", "Bitcoin Cash is the real Bitcoin, as envisioned by Satoshi Nakamoto. This peer-to-peer electronic cash system enabl????>_", "\"The vision of Satoshi Nakamoto lives on in the form of Bitcoin Cash\" \\n- @CryptoStratz \\n\\nLearn more at????>_", "Waltonchain official response to the recent Twitter incident. #waltonchain $wtc \\n\\nVideo Link:????>_", "How to change your Bitcoin Core ????>?\u008fstore of value????>?\u009d tokens for Bitcoin Cash cryptocurrency in the????>_", "I just bought 50 Bitcoin (BCH) ATM machines for a bit under half a million dollars. Thanks to our purchase the man????>_", "RT @coinbase: Customers using credit cards on Coinbase: the following card issuers are now blocking purchases of digital currency with cred????>_", "RT @alistairmilne: Someone has opened nearly 4000 BTC of shorts vs USD since around 8am. We are either being front-run or they want to caus????>_", "Payments giant @stripe discontinues Bitcoin Core payments, citing high fees and slow transactions. \\n\\n\"It????>??s possible????>_", "The Bitcoin whitepaper describes a problem inherent in legacy payment systems: \\n\\nIncreased transaction costs limit????>_", "PARIS (Reuters) - France and Germany will make joint proposals to regulate the bitcoin cryptocurrency at the next s????>_", "Bitcoin Core's mission statement has gone from being \"Bank the Unbanked\" to \"Let them eat cake.\"", "\"Just pay a $5 fee and it'll go through every time unless you're doing something stupid.\" - Bitcoin Core developer????>_", "Bitcoin was working great until Blockstream used censorship and lies to hijack the network in order to intentionall????>_", "Why Some People Call Bitcoin Cash ????>?Ebcash????>??. This Will Be Shocking to New Readers.", "Bitcoin is BCH", "\"Skeptics Say No One Uses It But BCH Daily Transaction Volume Is Catching Up With the Litecoin Network\"", "Are there any compelling arguments against Bitcoin Cash? The usual arguments go:\\n\\n- \"It's an altcoin\" (ad hominem)????>_", "It's so nice to see the Bitcoin community coming together to work on positive developments once again. \\n\\nWay to go,????>_", "Median transaction fee on Bitcoin Core: $15.932\\nMedian transaction fee on Bitcoin Cash: $0.0291\\n\\nBitcoin Core is 54????>_", "BitClubNetwork announces that they will be switching to #BitcoinCash (BCH) on Feb 1st, citing extremely high fees o????>_", "RT @jonnajarian: A friend has two tickets for the Super Bowl, paid $2,500 each but he didn't realize it was the same day as his wedding. I????>_", "announces that #BitcoinCash is the real Bitcoin, and will be gradually deprecating features????>_", "via Reddit: \\n\\n\"got $50CAD worth of BTC for christmas, and had to use a $25CAD worth of transaction fees. then after????>_", "\"In the 2 minutes and 40 seconds the BCH-USD book was open for trading:\\n\\n4,443 orders were placed\\n3,461 matches occ????>_", "Latest News: Microsoft Has Stopped Accepting Bitcoin Deposits #Bitcoin", "Latest News: Litigation Filed in India for Immediate Intervention of the Flow of Bitcoins", "Global warming proven conclusively false for the 174th time. Looking forward to seeing it get proven conclusively t????>_", "Latest News: Tron, Cardano, Verge and Ripple ????>?' Four Cryptocurrencies That Actually Meet the Definition of Vaporware????>_", "According to Twitter you can????>??t advocate for murder on their platform unless it is mass murder funded by theft. Then????>_", "RT @justinsuntron: Five brilliant developers from #alibaba #Microsoft #JD #PKU just joined #TRON this week. I will introduce them in the li????>_", "RT @justinsuntron: Thanks, CNBC. But we are not \"tiny\" digital coin and we will be huge soon with great decentralized blockchain technology????>_", "RT @justinsuntron: Google Trends Japan #TRON #TRX $TRX Japanese are crazy about #tron.", "South Korea Expected to End Anonymous Crypto Trading by January 20", "I found a photo of those ????>?\u008fEvil Chinese????>?\u009d that support Bitcoin Cash that we keep hearing about.", "RT @kingbtc: And one for the $XRP boys", "The current version of Bitcoin Cash can easily handle all of the Bitcoin Core and Ethereum transactions combined."], "0": ["RT @BitcoinByte: #Cardano [#ADA] aims for mainstream adoption with Emurgo (@emurgo_io) - Metaps Plus partnership @seungyeonkim\\n#Blockchain????>_", "RT @PhanTi_91: We are proud to announce that @bitebtccom lists XVG/BTC starting 05/10! Verge is becoming an increasingly attractive currenc????>_", "#TokenPay Announces Acquisition of 9.9% of WEG Bank AG in Germany with Option to Acquire an Additional 80.1% upon A????>_", "\"Payments is the baseline use case for unlocking the value in #blockchain.\" \\n-@ashgoblue's keynote at????>_", "????>?\u008fAt its core Ripple is a technology company leveraging digital assets to solve a global payments problem. We believ????>_", "RT @trafficjunky: It's here. \\n\\nTrafficJunky will be accepting Verge cryptocurrency starting next Monday! $XVG #XVG\\n\\nMORE", "RT @iotatoken: We are moving rapidly towards the next epoch of IOTA, today the IOTA Foundation is excited and proud to start the official u????>_", "We are moving rapidly towards the next epoch of IOTA, today the IOTA Foundation is excited and proud to start the o????>_", "#NANO Competition - 15,000 $NANO To Giveaway", "Goldman Sachs to Open a Bitcoin Trading Operation", "The IOTA Foundation is really happy and proud to be part of the MOBI Alliance\\n\\n\\n\\n#IOTA", "Taxis Take BCH, Stores Sell BTC in the Russian City of Rostov", "RT @bitfinex: Trading is now live for XLM and XVG.\\n\\nBoth pairs can be traded against BTC, ETH, USD, EUR, GBP & JPY.", "Sharding is coming.", "I just published ????>?\u008fIntroduction of ICONest: ICON????>??s Token Launch Platform????>?\u009d", "RT @BitcoinByte: More power to the #Cardano (#ADA @ADAcoin_ ) team ????>?' Proof of-stake (PoS) is now solved! \\n@Cardano_ @sol3gga @InputOutputH????>_", "Introducing the VeChainThor Blockchain Transaction Model, an innovation enabling mass adoption.", "RT @cryptomanran: I interviewed @justinvendetta from @vergecurrency, Learnt the following:\\n founder @justinvendetta , smart and humble????>_", "????>?\u008fIn what rational universe could someone simply issue electronic scrip????>?\"or just announce that they intend to????>?\"and cre????>_", "????>?\u008fPantera has about 10 percent of its investments in Bitcoins... But the fund????>??s single largest bet is on Icon????>?\u009d $icx????>_", "RT @mercury_fx_ltd: In Q1, along with other xRapid pilots customers, we have proved that #xRapid can lower liquidity costs & increase payme????>_", "We????>??re excited to announce $NANO deposits and withdrawals on @binance are open again. Big thanks to @cz_binance and????>_", "The 2018 Q1 #XRP Markets Report is here! We take a critical look at the digital asset and the ecosystem around it.", "RT @CoinPaymentsNET: Congratulations @vergecurrency for your partnership with @mindgeek! CoinPayments is proud to provide #XVG payment proc????>_", "*ANNOUNCEMENT* Power Ledger and Japan????>??s second-largest electricity utility Kansai Electric Power Co. (KEPCO/????>_", "????>?\u008fWe are covering 50% of all the FX payments the Santander Group does annually. It works really well????>_ we????>??ve tested f????>_", "RT @TorGuard: @SilvesterHQ TorGuard VPN is now accepting #XVG for all services!"]}