{"1": ["EOS is cashing out? 210k ETH sent to Bitfinex.", "Seriously, how is it possible to be this delusional??", "coincall.io labels Bitcoin Cash a \"scam\"", "I just doubled my Verge holding", "As a startup focused on cryptocurrency adoption - Bitcoin Core is not even close to as practical for use as Bitcoin Cash", "In only two weeks Bitcoin (BCH) will be able to support 100M+ users", "EOS: Don't Believe The Hype", "I hate to break up the conversation....", "Security Audit Firm Discovers Critical Vulnerability in EOS Smart Contract System", "I entered a Tron Telegram group with 24.000 people in order to get info about tech. An unbelievable experience.", "Binance should enable EOS/USDT seeing as EOS is currently mooning.", "More Bitcoin Cash Posters in downtown SF!", "EOS price analysis: The only crypto to touch the sky again!", "The most important aspect of EOS", "If you think the EOS valuation is real, first watch John Oliver dissect it before buying into the hype", "EOS will be extremely centralised with 21 handpicked nodes", "MAJOR Crypto Influencers Caught Planning Massive Pump And Dump Schemes", "Can you please retweet? We would like freelancer.com to integrate Verge currency as a payment option.", "WARNING: MyEtherWallet has been DNS hijacked. Your funds can be stolen if you use the website. Wait for an official update.", "MyEtherWallet has been hacked/breached", "\"Why #BitcoinCash will win the battle for adoption? Easy: common people are not going to buy Bitcoin Core to buy Lightning Tokens to buy a coffee. Also, no way to earn it. We are creating #TheNewMoney\"~Alex Agut (HandCash)", "Can a verge staff member update us on the things ahead?", "Plenty of coins use the Bitcoin name. If you have a problem with the name Bitcoin Cash it????>??s because something deep inside tells you it might just be the real Bitcoin.", "Bitcoin Cash has risen 80% over the last week...", "Everyone should be skeptical of EOS and avoid it", "\"Billion-dollar corporations take note: Bitcoin Cash is open for business! Just try to fill up our blocks, I dare you. There will be no \"Fidelity Effect\" with BCH. Unlike BTC, we _want_ you to use the Blockchain. BCH never really hits a scale ceiling.\"~Dr. Peter Rizun", "I did it. I just sold most of my bitcoin for bitcoin cash.", "Show your support in getting XVG on Pockerstars!", "\"Bitcoin Is The Past, The Future Is Bitcoin Cash (BCH)\" - Boerse Express (German article)", "one reason have made me purchase Verge", "A small tip on what people can do to help verge increase in value and strength", "YESSSSSSSSSSS! #Binance #USD/XVGPair", "Like and retweet to let Coinbase know we want XVG on coinbase!", "Roger Ver: \"Dear @reddit, [...] I'll pay you $100,000 USD if you simply appoint a moderator to /r/Bitcoin who supports free speech.\"", "\"THE FUTURE HAS COME\"", "Doug Polk F*CKED by PornHub! SPREAD THIS!", "What a disapointment", "Brazzers too? Maybe all the porn sites are on board", "Verge playing the long game _??_?\"", "HAHAHAHA the nerve of the Verge team. I've only just received enough Karma to post but I will gladly waste this to express my thoughts on this project,", "Pornhub & Verge Partnership Announcement Video", "How Vergefam responds to r/CC's FUD", "Verge wins todays highest volume and % gain", "\"Is Verge the Next BitConnect? Ongoing Inconsistencies Alert Crypto Community\"", "Verge exit scam? Connecting the dots", "Verge lead Developer has been arrested 8 times. Get out while you can", "My god, XVG developers still continue to lie even after the CTO of engineering SAID that they won't integrate the ledger", "The Verge Team, A bunch of clowns", "Massive Red Flag - VergeDev: \"The money moved is to pay for Ledger integration\". \"Ledger's CTO: \"I'm not aware of anybody on our team working on XVG\"", "Verge owners are now selling the XVG raised for their \"Partner\" on Binance", "WE DID IT GUYS!!!!", "EOS team is suspected of colluding with VCs and Block Producers", "Xvg Price", "VERGE touches .0820 and now No 19 in the crypto world..", "So no one else finds it a bit odd that Verge is actually going up in price in a bear market, after a hack attack, after being outed for paying McAfee to promote it, and after the 1 developer begged for money from his own community to allegedly help pay his taxes?", "Ontology circulating supply is INCORRECT on Coinmarketcap. Please read investors.", "Let me get this straight about Verge...", "The partnership is safe!", "Why #TRON is better than #ETH: (1). 10000TPS vs. 25TPS (2). zero fee vs. high fee (3). consistent Coinburn vs. no coinburn (4). Java vs. Solidity (5). strong extensibility vs. no ex. (6). 1 billion USD developers rewards vs. no plan (7). 100 million users vs. small number #TRX", "EOS, why we all should boycot it", "Verge cryptocurrency set to unveil exclusive partnership in April", "Turns out the Verge fiasco is worse than thought. Devs now having to issue new wallets having accidentally hardforked their own currency trying to fix the attack. Popcorn, salt and GODL overflowing", "Network Attack on XVG / VERGE. Hacker mined a block every second for the past 13 hours", "VERGEFAM! We need to show support outside this subreddit.", "10,000 BTC just moved from Gox wallet", "r/Cryptocurrency usually automatically downvotes any pro-BCH thread into oblivion. But I got my CoinText.io post to trend to #3 on their front page, by simply not saying \"Bitcoin Cash\". Proof that people would love BCH if they kept an open mind.", "Bitcoin Cash drops below 0.1 BTC as it fails to gain traction", "Do not panic Selling! This contain summary of recent Livestream. Tron has bright future with many great projects, partnerships and exchanges coming ahead.", "\"While BTC is having negative adoption, BCH is having massive adoption around the world. Fun facts: BTC is now controlled mainly by socialists, while BCH is mainly supported by ancaps.\" ~Roger Ver", "EOS is now #6. Let's go!", "KuCoin Eliminates BCH Pairs from its Platform | CCG", "The whole cryptoverse just watched verge ask for 75 million xvg as donations for the biggest crypto deal in history. They said they will tell us when the funds are raised. Then the lead dev says he will do it in the morning. The entire cryptoverse is watching xvg", "Let me get this straight...", "Trons community plan is written in broken English and they still don't have a real product yet, it's a billion dollar company. This is exactly what is wrong with the community.", "\"We've tested Bitcoin Cash vs Lightning Network and... LN feels so unnecessary and over-complicated. Also, still more expensive than Bitcoin Cash fees - and that's not taking into account the $3 fees each way you open or close a $50 channel. Also two different balances? Confusing\" ~ HandCash", "Verge (XVG) cultists banned me for nothing.", "NEW Verge Video Update just released", "This Verge clownshow is humiliating to me as a cryptocurrency holder and seems like an obvious argument for SEC regulation", "Ethereum guy here, wishing you all the best", "Made the switch to BCH", "EOS is blatantly viewbotting its YouTube videos", "Bitcoin.com to now support Bitcoin Cash as default, Bitcoin core not supported", "Ver announces Bitcoin.com wallet will no longer support a default BTC wallet, only BCH, at Satoshi's Vision", "VERGE Asks their community to crowdfund 75 million XVG by Monday so that they can release details of a potential partnership \"under NDA\". Please do not support this ridiculous scammy bullshit", "Fuck Yeah!!!", "Suppoman talking to lead dev of Monero, without realizing who he is. Stop giving your money to this guy.", "I really hope on the next altcoin run people stop investing in shitcoins that makes the entire market look more like a lottery", "Bitcoin Cash is everything that Bitcoin was supposed to be, before it was taken over by a small group of radically minded ????>?\u008fCore developers????>?\u009d, largely through propaganda and censorship", "\"Sorry for any confusion. VeChain is participating in the BMW Startup Garage programme.\"", "Entrepreneur Calls Bitcoin Cash 'Bcash,' 'Scam' to Canadian Parliament", "I just want to say", "There is a strong organised EOS FUD campaign. Don't fall for the trap!", "Warning: If you have signed up to the DADI ICO, your information has been leaked by the team to hackers and phishers, who are currently exploiting this data for phishing scams. THE DADI team is trying their best to cover up any trace of this happening.", "A message from Sunny Lu: STOP ASKING VECHAIN PARTNERS FOR MORE INFO", "RIP EOS lol", "How ETHLend was built from scamming its workers", "I sold half of my ETH & bought ETC...I think ETC is the way to go!", "interview with Synth and Jonathan from Skycoin", "[Analysis] Top 20 ICOs raised over $2.4 Billion and yet there are still no products", "Bitcoin Cash is a scamcoin. That's not just empty rhetoric. Here's the story, summarized.", "6 of 12 top coins are officially centralized", "DEV on Twitter Rips Into NEO. Looking for Community Rebuttals.", "Paid a beer using Bitcoin Cash in Paris, adoption is real!", "Coinbase is listing XRP tomorrow!", "Walton Chain caught rigging their valentines event in deleted tweet. Forgot to change to fake account before posting.", "Waltonchain faking giveaways?", "Walton got busted fake winners on Twitter", "It????>??s time for another reminder - Craig Wright is NOT Bitcoin Cash. He never was. Bitcoin Cash is all of us including anyone that wants to be a part of it. No single person owns or controls Bitcoin Cash.", "Why I believe ripple is the best crypto to invest in!", "Bitcoin Cash is King", "Sold my ADA and put it into NEO!", "Coinbase is out of control, go to /r/coinbase to see the carnage.", "You should know what is happening at HitBTC", "Loopx.io just exit scammed", "I'm all in. Just converted the rest of my BTC to IOTA. Time to clench my asshole and HODL!", "The Bitgrail hack was months ago, bomber defrauded new users of their assets to pay off old users. This is a criminal act. We need to contact the EU/Italian authorities & make sure he's punished.", "Sad but trueeeeeeeeeeeeeeeeeee", "Over time, Bitcoin Cash (BCH) is gaining on Bitcoin (BTC).", "BitGrail got hacked and is insolvent.", "Bitgrail update", "Chart looking dangerous.", "Bitcoin Hodlers during the next bull run!", "Why is BCH pumping today?", "Binance delayed reopening delayed until Feb. 9 4AM (UTC)", "Ripple which is supposed to replace legacy banking system is missing 32k blocks from its ledger", "My First Crypto Coin Buy", "??????\u008f 33 Major Bullish Developments in Bitcoin Cash Ecosystem Last Week??????\u008f Although a lot of us have been focusing on the depressing prince moves in BTC & BCH over the last few days, there has actually been many major developments in the BCH ecosystem. (BCH Paywall)", "Chase Bank Credit is now treating Coinbase as cash advances, hit with a $10 fee on a $25 purchase.", "Rippex, the Brazilian XRP exchange responsible for the Ripple Desktop Wallet is ceasing operations.", "Everywhere i say Verge i get downvoted. Go and support XVG posts!", "Buying Cryptos in 2018", "As we weather this crash remember the reasons why you should hold this coin.", "Who????>??s still All-In with iota??", "U.S. Regulators to Subpoena Crypto Exchange Bitfinex, Tether", "Bitgrail Update - Disabled XRB withdraw", "The Owner of Bitgrail has just scammed it's users out of millions of dollars causing the price of XRB to fall over 50%. Could someone who lives in Italy contact the authorities & find out if something can be done.", "How to get cheap XRB", "Can we do it? Vote for Verge!", "The mod team of r/tronix has kicked all active moderators out, in a cleansing effort he has kicked off the mods that ensure rules are enforced and the ones that design CSS. The mod team has created a new replacement subreddit as result.", "/r/bitcoin is censoring the NIST report that says \"Bitcoin Cash is the original blockchain\" and Bitcoin Core is not. If you have to censor to get people to believe you, then you have lost.", "National Institute of Standards and Technology confirm: \"Bitcoin Core (BTC) is a fork and Bitcoin Cash (BCH) is the real Bitcoin\" p.43 para 8.1.2", "Gut wrenching", "Breaking: Tether has \"dissolved\" relationship with auditor Friedman LLP, according to spokesperson for the company behind $USDT token. Story to come.", "Crushing the FUD on XRP", "We need to petition to get TRON onto the ROBINHOOD app", "Coincheck Hacked: \"The Biggest Theft in the History of the World\" Long Wong confirmed", "Welp Bitgrail just required verification of ANY withdrawals without notice.", "PSA: Account verification is now mandatory on BitGrail, they have changed withdrawal limit from 0.5 BTC to 0 BTC - There are people waiting for their verification for 4+ weeks; since BitGrail is the largest XRB exchange, XRB price will fall even more", "Bitgrail no longer allows withdrawals in unverified accounts", "Facebook confirmed", "Stripe ends BTC support due to block size limits and high transaction times.", "CNBC????>??s Dan Nathan: Bitcoin Cash Will Overtake Bitcoin Soon", "Pls read if you own BTC and do not understand the impact of Futures contracts.", "Let's do something about Tether? Please?", "TRON and XVG are the worst shitcoins that will make you lose money in 2018", "Bitconnect still being advertised on coinmarketcap. We need to communicate with them as a community, this is not acceptable. We will not tolerate innocent people being scammed.", "CNBC's Fast Money on Bitcoin Cash: \"it's actually more interesting\" ... ??????\u008f", "XRP The Standard!", "The ONLY way to Day Trade Crypto", "First brewing company in United States to accept Bitcoin Cash starting tonight!", "Tangle down? Price falling.", "China orders banks to stop financing cryptocurrencies & plans his own digital currency", "Cancelled my CapitalOne card: They are blocking all crypto transactions", "Why VERGE is just BETTER than other privacy coins.", "PSA: Stay away from Bitcoin.org! The website is misleading millions of users regarding Bitcoin Core fees and speed.", "Please Help! Kraken lost my $12,000 and is not replying to a single email", "Despite massing brigading from r/bitcoin and core, @Bitcoin twitter account has gained 50k subscribers since it came out in support of BCH last week.", "Important! No node fixes in GitHub!", "Tron is leading the pack.", "We're going way back up!", "YouTube essentially shuts off small channels from earning revenue. This sounds a lot like the problem TRX is aiming to solve.", "I sent Kraken $25,000 over 3 weeks ago and they won????>??t deposit the money.", "Doomsday Scenario for EOS (You need to read this)", "Just threw another $10k in bitcoin cash, all that it was left in my trading account. So now I'm officially all in :)", "This is we need to support BitGrail:", "BTC and ETH not that decentralized after all", "Please ban the use of bots in your exchange", "Bitcoin Cash won't \"kill\" Bitcoin, it will become Bitcoin. BitcoinLegacy will be deprecated as unusable. We are witnessing this happen in real time.", "Why Ethereum sucks", "Be patient and hodl, soon 1 DOGE = 1000 BTC", "XVG to the sun", "The head of the porn startup Fantasy Market ran away after the ICO with $4.4 mln", "Reasons why TRON is not a scam", "TRON violated LGPL by copying code from Ethereum without attribution", "BCH overtakes LTC in tx volume on Jan 14th. #flippeningAhead", "Who Cares?", "Damned if he does. Damned if he doesn't.", "Tron gets caught again, Plagiarised White Paper, Now its Copy&Pasting Codes.", "TKY tokens shot up to x3. Wtf?", "Very disappointed that THEKEY completely changed the pricing terms of the ICO an hour before the crowd sale.", "THEKEY ICO Scam Alert!", "New Bitcoin Cash Logo Suggestions for a Modern Look", "Check out all the red, Tron is not alone, Tron is not down because of fundamentals!", "R E L A X.", "Sorry guys but I think it????>??s time to cash out", "Bitcoin Cash Now Accepted in 1,200 Restaurants in Denmark", "I just made this Bitcoin Cash logo with a white, inner ring, making it look more like an actual coin. Thoughts?", "PSA: Major kraken bug causing users to lose all their funds - Please upvote for visibility", "Made a little painting of one of my favorite coins, Litecoin! :)", "I feel like I'm gonna regret it if I won't invest all my savings in VEN", "Wheew! $3.50 was the bottom, Now calculating > $8 USD by Feb 1st", "Why is the tangle so slow at the moment?", "One advice for Coinbase", "[170k+ MEMBERS] PUMPING ALTCOINS | DISCORD CHAT! (MAKE OVER 30%+ PROFIT) - NEXT PUMP IN 15 HOURS! | INVITES CLOSING IN 12 HOURS", "Kraken down 36 hours", "Official BCH Launch on GDAX next week!! To the Moon!!", "We won't launch any new coins until ETH issues are fixed...LOL just kidding....", "If anybody is still on Kraken, this HAS to be the last straw. After 7 hours of warning for a maintenance update, they've been offline for more than 14 hours at this point. They have no ETA for being back online.", "When is the next big release for Verge?", "Barack Obama is a Twitter follower of RaiBlocks core developer Zack Shapiro.", "Bounties | has anyone ever been paid by the IOTA Foundation?", "On Charlie Lee's Litecoin Scam ????>?' Bitfinex????>??ed", "I cannot believe I actually came this late to this conclusion about Bitcoin legacy.", "Hello everyone. Just moved all my LiteCoin to Dent", "Almost all Alt coins are down and Bitcoin has taken a beating. Keep HODLing.", "OMG! This is Big! Listerine now accepts Cardano. To the moooooon", "Block Explorer announces retirement of support for the Blockstream fork of bitcoin, declaring it an \"evolutionary dead end\"; supports Bitcoin Cash going forward, and will refer to Bitcoin Cash as just \"Bitcoin\" at some point TBD (once-only message display)", "Blockexplorer.com going to call bch \"bitcoin\" while technologically obsolete btc will be called \"bitcoin legacy\"", "Rick Falkvinge????>?\u008f: \"Here's why I'm considering the Bitcoin Cash fork to be #bitcoin, explained in good faith and with as much objectivity as I can, as opposed to the Blockstream fork of bitcoin\".", "I think Zencash is the robust/reliable version of Verge", "NEW INVESTORS: DO NOT INVEST BY FOLLOWING. INVEST BASED ON PSYCHOLOGY.", "website that look as identical by way of Netflix but holds objective cryptocurrency videos!", "I think someone wants to influence the price...", "Is MEW website being hacked?", "New Exchange listing NEM! Register now for FREE and get a 500$ Fee Bonus!! Share the link with your friends!", "Why EOS will overtake Cardano in 2018", "Vote Verge", "Tor Integration to 4.0.1!", "Wraith full just went live mufuckaz", "Vote for Tron", "I CHALLENGE ALL OF YOU..", "**Alert** - T-Minus 1 hour until TRX becomes available on Korean Exchange Coinrail - bull run likely incoming.", "China is serious about a Bitcoin mining shutdown [Quartz]", "Stop selling", "\"I regret to inform you that the reputation of the @Bitcoin Twitter account is now questionable. Appears it was sold to help drive traffic to bitcoin(dot)com and will likely be ramping up to full blown \"Bitcoin Cash is the real Bitcoin\" propaganda before we know it.\" @Lopp", "Microsoft joins Steam and stops accepting Bitcoin payments", "$40 ", "We have survived. Nothing can stop us now.", "Microsoft drops Bitcoin as payment method", "Cryptonick is selling a cryptocurrency course for $497, and yet he doesn't even know the difference between a public key and a private key... welcome to crypto folks!", "REDDCOIN IS AT ITS HIGHEST MARKET CAP/PRICE IN ALL OF RECORDED HISTORY AND YOU ARE A PART OF IT", "RDD, lift of Confirmed!", "(23:03) It won't be Verge I'm really sorry, and here is why, Verge is a great concept, their development team seems to be lost in space. Whereas Monero, THOSE, PEOPLE, ARE, ON IT", "Begin reporting HYPE!! comments, we are not children (maybe some are)", "All Bitcoin Visa debit cards are now cancelled", "I just read Tron's whitepaper. It raises more Red Flags than a Worker's Parade inside the Soviet Union", "Ripple is a funding scheme to help the banks fight Bitcoin. XRP is not Ripple. Banks have no interest in buying your XRP", "Why I think Tron is bullshit", "Ripple could change my life...", "So I found my 1000 ripple from the giveaway. Ready for the ride!", "Ripple co-founder is now richer than the Google founders on paper after cryptocurrency's surge", "Binance sort your servers out please, in times like these we need to be on your servers...", "Charlie Lee: \"As you can see, Litecoin is doing very well in terms of growth in usage. This chart shows the growth in the past year compared to other coins. Let's not let price distract us from what's actually important. This is what I mean by conflict of interest. No LTC, no distraction.\"", "Bytecoin and Amazon", "XRP overtaking Bitcoin would be epic", "This is what Happened with the last two Winners on Binance Rounds 3 and 4. ???\u0081BOOM!", "Beware of fake binance sites in google ads as i just landed on in the image.", "Why I believe Vechain could reach $100 in 2018.", "Amazon to implement Litecoin as a payment method in 1-2 weeks per Amazon Support Rep.", "Cardano unavailable for withdrawal at Bittrex. Any idea normal withdrawal/deposit should resume at the exchange? Thanks", "Bought 103k xvg!", "Cryptocurrency use in Vietnam may be criminalized", "There's so much tension regarding Litecoin", "I signed a 1.27 USD fee transaction 3 weeks ago. It confirmed today. 34,085 minutes later. That's the \"Internet of Money\" provided by Bitcoin Core.", "Petition to delist Verge", "For everyone here wondering why XVG price is dipping after Wraith release", "The wraith protocol is that good at privacy it's hidden its own existence.", "Missing the deadline is one thing, but to fucking post multiple times ensuring us that you will tweet before hand if you are off-schedule and that it will \"for sure\" be released before 2018 is another. You can't hype something up like that and not deliver. It comes at a cost and that cost was trust!", "tonight is gonna be good night.. verge couldnt deliver what they promised to by EOY 2017.. i am expecting millions of dollars to move from XVG to IOTA with UCL hype surrounding around and IOTA being signicantly cheap with latest dip !!", "Verge misses a third deadline for this year for Wraith", "upvote if you still have hope!", "Finally broke the 1600 sell wall. Getting interesting now!", "XRP handles huge volume unlike other coins", "Launch is good to go boys! All Wraith tests are green! Checkmarks across the board. The UI is also being tested as we speak.", "We have real customers, really in production using this,????>?\u009d Garlinghouse, 46, said, ????>?\u008fnot science experiments. Science experiments are not a business model.????>?\u009d", "2018 will be the year when Bitcoin Cash overtakes Core", "BCH is provably a better store of value than BTC", "A centralized bank coin is now the 2nd largest cryptocurrency, good job everyone!", "The big four banks of Australia are beginning to freeze accounts over Crypto activity", "I'm not that tech savvy but still wanted to contribute to the community because I love Iota. I hope you like my iota girl!", "Just spotted in Warsaw, Poland! Translation: ????>?\u008fDO NOT BUY MONERO - cryptocurrencies damage the banking system and can weaken the state apparatus????>?\u008f", "John McAfee asked for $1.1 million to support Verge - XVG Whale", "620 Million USDT issued in Decemeber.", "Ripple user comes to defend Ripple, gets hundreds of upvotes, but can't answer the most fundamental question: what prevents inflation?", "[SERIOUS] XRP price manipulation by Bithumb spotted!!", "Reminder: Ripple XRP is centralized, and they can freeze any user's funds, especially when asked by the government.", "Okay, this Ripple shit is ridiculous. We need to educate people before we have PayPal 2.0 at the top of all the *actual* cryptocurrencies.", "Ripple to OVERTAKE bitcoin? Ripple ONLY cryptocurrency to RISE after South Korea crackdown", "Some perspective", "WE FUCKING DID IT. RIP ETHEREUM", "Bitcoin Cash is best positioned to be the #1 everyday cryptocurrency. It is the only one supported by both Coinbase & Bitpay, and also have a low transaction fee.", "Losing hope a little bit...", "Binance down?", "And we just hit another milestone...what an achievement!!", "While bitcoin implodes, this rival cryptocurrency has grown by a jaw-dropping 22,000%", "What Cardano Roadmap updates feel like", "John Mcafee buys sia?", "Oh My God! New Video from XVG Whale Tonight! Check Twitter! He is WEARING A SUITCOAT AND DRINKING DESIGNER WATER!!! This is not a drill!", "The people behind Bitcoin Cash know it is about improving the world rather than chasing lambos."], "0": ["Bithumb lists ZIL!", "Uphold to implement \"full support\" May 24th", "Friendly reminder that time is more precious than money", "Details of the TokenPay Partnership with WEG Bank AG in Germany", "Coinbase has seen 1000% increase in transaction capacity which it plans to double in the coming months. Has 1000 dedicated personnel and has recently valued itself at $8B up from $1.6B last year.", "Letter to TRON community: On Progress of TRON Mainnet And Ecosystem", "They are starting to develop EOS-Inspired dPoS patches for Ethereum...", "Just like Netflix and Amazon before that Ripple/XRP gets a ton of FUD because it is a threat to established businesses.", "The Exciting Rise of Zilliqa (ZIL)", "Happy Halving Day!", "BREAKING NEWS!!! - CryptoBot just said Binance is testing XVG USD as we speak and it XVG is already up 5%", "More Whales are coming: Iranians are buying Billions of Dollars worth of Cryptocurrencies", "Why the future of Ethereum is looking bright", "\"In fact, a group of central banks is actively experimenting with the use of digital currencies and distributed ledger technology with the aim of making cross-border payments more efficient.\"", "Exciting things to happen this year:", "The First Version of Ethereum????>??s Casper Upgrade Has Been Published", "I am surprised this isn't getting more attention. New York Stock Exchange Will Develop a Bitcoin Trading Platform", "Cardano ADA token gets listed on Korean payment platform Metaps Plus", "Ada is now accepted on Metaps Plus - one of South Korea largest mobile payment platforms! - Announcement made by Emergo!", "New York Times Front Page Today In Case You Missed It!", "\"The law deserves respect, but technological progress should not be bound by the limits of the regulator????>??s lawyerly imagination.\" SEC Commissioner Peirce gave an incredible speech about tokens and regulation. Read it all:", "MoneyGram: \"We are increasing our investments in digital assets as we accelerate our transition to a digitally enabled customer-first organization.\"", "\"ICON (ICX) bullish signals on the 1D Chart - C&H + Double bottom\" by trader theVoidy ????>?\" published May 08, 2018", "Don't worry guys, we're not going down. Think about the big picture.", "IOTA Resists the Decline, Maintaining 170% Gain Since Last Month", "Hannover highlights of Iota and industry 4.0 : by Fujitsu", "EOS is crazy fast! EOS Authority build a space invaders game, that is controlled via onchain transactions. Seriously, this is so cool.", "Space invaders on EOS blockchain with 500ms latency", "IOTA live on Huobi. Touches $18", "Huobi - IOTA Trading Starts on May 08 17:00 (GMT +8)", "All ERC20 Tokens can move to Cardano.", "Circle (owned by Goldman Sachs) adds Monero as their 7th available coin", "Tyler Winklevoss ????>???dares Bill Gates to REALLY short Bitcoin!", "Apparently there is no SEC hearing on Ethereum today and it is all just orchestrated FUD.", "No SEC Hearing today! Fake news spreading like wildfire!", "Trinity Wallet Update - 7th May", "SWIFT: \"Cryptocurrencies will not solve delays in international payments\"", "Why Ripple is Raging Through the Headlines Right Now", "Is this SEC ????>???Is ETH a security?????>??? meeting actually happening? Or, is it all FUD?", "The SEC hearing thing is mostly fake news", "Apparently there is no SEC hearing on Ethereum today and it is all just orchestrated FUD.", "Korea to Ease Cryptocurrency Regulations", "Coindcx lists XRP with contest, it has same liquidity of Binance. Sadly, Registrations open only for Indians", "Reminder: \"With the BitLicense in hand, we look forward to working with our New York bank customers seeking to use XRP for liquidity and cost savings.\" - Chris Larsen", "Traffic Junky Accepts XVG starting from Today", "India's largest exchange Zebpay with 3 million users adds 0x (ZRX)", "Korea????>??s New FSS Chief To Relax Cryptocurrency Regulation", "Korea To Relax Crypto Regulation", "Warren buffet admits he was wrong about Google and Amazon - this from a guy who????>??s advising people to stay away from cryptocurrencies.", "Bitcoin cash will be hard forked on May 15: block size will increase to 32MB", "Verge (XVG), Spotify Partnership Idea Gathering Massive Support", "3 months ago today BTC hit it's low of $6,050. Feels like 3 years.", "Ripple would not move xRapid into production if they did not know what regulators say about the status of XRP beforehand!", "Keep on voting on Spotify Hot ideas for VergeCurrency to show how powerful is our community", "EOS: Unlimited Scaling Possibilities", "XVia From Ripple (XRP): A Bridge Between RippleNet And ERPs (SAP And Oracle)", "Cardano to Help Ethiopia Grow Coffee Using Blockchain Tech", "Elon Musk will bring humans to Mars, and cryptocurrencies to the moon", "The block size limit is not and was never an \"anti-spam\" measure. It prevents the \"poison block\" attack. In fact the block size limit actually creates the spam attack vector.", "Bitcoin Cash flippening status now over 18%", "Verge (XVG): Price will follow mass adoption.", "Buy train tickets with Bitcoin in Switzerland", "LISK 1.0.0", "Coinmarket cap removed the fraudulent Bitcoin.com from Bitcoin's listing page.", "Potential of Zilliqa (ZIL): Could We Witness Another Altcoin Moon in 2018?", "Coinmarket cap removed Bitcoin.com from Bitcoin's website list.", "Bitcoin hits 10k USD!", "Blue Node Capital report: Big things a-coming in mid May & other interesting tidbits", "Ethereum price breaks above $800.00 with strong Bullish trend", "Porsche Digital Lab is looking forward to working with IOTA on Autobahn project", "Verge listed on bitbns, big Indian exchange!", "Bitcoin Cash surpasses $1600", "How IOTA????>??s Qubic Might Be on the Verge of Revolutionizing Finance", "Iota working with Porsche lab and Porsche", "China slowly enters crypto, good news for Neo", "Major downtrend is broken, now get ready for moon", "Ethiopia Signs a Deal with Cardano to Use Blockchain in Agriculture", "Ethiopian Government Partners With Cardano", "As Coinbase Looks to be the Google of Crypto, Are They Becoming the Bitcoin Mafia?", "Daniel Larimer - EOSIO Dawn 4.0 - 10 features, xcluding merges, 43 authors have pushed 818 commits to github. Now is now Now !", "Top crypto exchange Coinbase prepares for a monster increase in trading", "Ripple Net can communicate directly with SAP & Oracle ERP systems using xVia ! Game changer for companies.", "Cardano leads the top 10 with huge crypto gains in April", "TrafficJunky to accept Verge (XVG)", "Now that XVG will be accepted on TrafficJunky, Revenue Zone; a digital marketing agency wants to know how to accept Verge too!", "Tron is \"pushing hard\" to be added to Institutional Exchanges (Coinbase, GDAX, Circle)", "Interview with Dominik Schiener \"Together with the industry we take IOTA to the next level\"", "TrafficJunky starts accepting Verge!", "A gentle reminder why Ripple/XRP will succeed.", "Qubic: Potential Impact", "TrafficJunky Accepting Verge Starting May 7th", "Heads up boys: We're on the brink of something massive.", "It's official from TrafficJunky! Verge is in starting Monday!", "Big Four' Giant PwC Invests in Chinese Crypto Startup VeChain", "Cardano Roadmap Update Review", "Another Airdrop coming to EOS-Holders -> EOS.Hedging", "May the 4th be with XRP", "CoinMarketCap should remove Bitcoin dot com website from Bitcoin's page", "IOTA on COBINHOOD!", "#PwCHK & #PwCSG announce joint business relationship with @Vechainofficial.", "Ethereum On the Brink of $800.00", "PwC Hong Kong and PwC Singapore announce joint business relationship with VeChain", "Binance adds XRP/USDT pair! Finally!!", "Ripple will release it's product to connect corporates and banks in Q3 2018 !!", "HitBTC interview BTCP team", "Hitbtc lists Bitcoin Private!!!", "IOTA (MIOTA) Ledger support coming soon!", "This is just the beginning", "Julie Maupin (IOTA Foundation) - was one of the panellists at the 51st Asian Development Bank (ADB) Annual Meeting ADB Seminar. I think it's impressive that the IOTA name is brought before such a panel. The live stream was a few hours ago.", "IOTA nearing ATH in BTC", "Qubic announcement on Discord by David", "Qubic IOTA", "Ethereum Price Will Reach $15,000 This Year: Reddit Co-founder", "CFB????>?? 1000th Tweet! Q", "Q!", "Cardano hits bitcoin magazine", "Roadmap update", "MOU signed with Ethiopian Ministry of Science and Technology", "Binance announces NANO trading competition", "Forbes Shilling IOTA!", "Reddit Co-founder Predicts Ethereum To Reach $15,000 Landmark this Year", "Huobi to list IOTA!", "Tim Draper - \"I think that cryptocurrencies will eventually grow to maybe $100 trillion and fiat currencies will fall from $80 trillion to $30 trillion.\"", "BREAKING NEWS: Goldman Sachs to Open a Bitcoin Trading Operation", "Request Network gone wild - London Letter's insanely good research of REQ", "Interview to Serguei Popov, mathematician & IOTA cofounder", "CEO Of Multi-Million Dollar Fund Says ????>???Now is the time to be building your positions????>???", "I just doubled my Verge holding", "Good news for LISK Core and sidechain developers: Google adds BigInts to V8, the engine behind LISK", "TRX will be listed on @CoinTigerEX and TRX/BITCNY, TRX/BTC, TRX/ETH will be available on 16:00, May 4th (UTC+8) click poster to know more.", "Ripple is going after the $1,200 trillion derivatives market with Codius!", "Iota Foundations Julie Maupin will be speaking tomorrow at the Asian Development Banks Annual Meeting on \"New Technologies in Finance: Opportunities and Challenges for Asia\"", "In only two weeks Bitcoin (BCH) will be able to support 100M+ users", "VERGE: TOP volume on bittrex again for past 24 hrs", "BMW, GM, Ford and Renault launch blockchain research group with over 30 founding members that also include Bosch, Blockchain at Berkeley, Hyperledger, Fetch.ai, IBM and IOTA", "Ripple Officially Coming to CoinSquare in 2-3 weeks", "BMW, GM, Ford and Renault launch blockchain research group for automotive industry", "Friendly advice. Accumulate ADA", "Ethereum: Almost zero chance of the SEC declaring it a security", "Da Hongfei for the Smart Economy Expo at the European Parliament", "The Ripple Smart Contract Platform: Codius", "APEX (Currently an NEP5 Token) Have Partnered With A Chinese Government-Backed Data Consortium", "New video on EOS", "Ripple Adds Another Bank to Instant International Payments Blockchain", "Verge is one of 5 latest additions to Abra! (Now officially stated by Abra)", "Why xVia will increase XRP Price", "Bitfinex will be presenting at EOSLondon tonight along with many other fantastic EOS-based projects. Stop by if you're in the London area!", "Cardano makes proof-of-stake algorithm security Breakthrough!", "Reasons why Icon will become huge in 2018!", "The VeChainThor Blockchain Testing Schedule", "The IOTA Ecosystem site is LIVE and it looks AWESOME!", "Japanese banking giant SBI will be launching a massive Crypto Exchange this summer!", "Verge is now accepted on Bitfinex with USD/BTC/ETH pairs!", "Bitfinex just added Verge!", "An analysis on EOS decentralization", "Anyone else seeing this action?", "BREAKING: Bitfinex listing Verge now", "For anyone interested, we have now listed BCH paired to GBP on our UK exchange.", "Found this today in Munich. Iota is spreading", "CarrIOTA Hercules: ready, steady,????>_", "EOS Is Long-Term", "Vitalik Teases Sharding Release on Twitter", "TRON got featured as #3 coin to invest in May 2018!", "Lisk adoption! Now pay for taxi services in Puerto Rico with Lisk", "Interview with the CEO of TokenPay (details about verge debit cards)", "IOTA (MIOTA) Teams up with Canada????>??s Kontrol Energy Corp. after Samuel Reid gets on board", "MIOTA is getting listed on COBINHOOD on May 4", "Transforming the Global Payments Infrastructure: Ripple & XRP", "ICONest - Icon Token Platform Launch!", "SBI Crypto Exchange Launch - Do people even, get it?", "ICONest: ICON????>??s Token Launch Platform !", "TRON was mentioned on CNBCFastMoney today! Great day for the TRX community!", "9 Hour Car ride - 9 Hours of Cardano", "Momentum picking up! \"Indian Cryptocurrency Exchange Koinex Adds First-Ever Ripple (XRP) Trading Pairs\"", "You can now send Nano via any messaging service (Email, SMS, WhatsApp, Messenger, Slack, etc) using NanoMate.", "Why EOS Skyrocketed 78% This Week", "Boycott the Digital Currency Group and Zcash: Says Steffen Vogt", "Nano gets Spanish Wikipedia page", "Compiling cardano-sl from develop branch. Proof of Stake almost ready?", "Verge (XVG): Coming Soon To A Bank Near You", "EOS price analysis: The only crypto to touch the sky again!", "Ripple (XRP) Liquidity Solution Satisfactory, MercuryFX Confirms", "@mercury_fx_ltd \"#xRapid can lower liquidity costs & increase payment speed and transparency using #XRP. We are looking forward to continued successful testing and going into production\"", "Cardano Becomes One of the Most Scalable and Secure Smart Contract Blockchains with Ouroboros Genesis", "You can now send Nano via any messaging service (Email, SMS, WhatsApp, Messenger, Slack, etc) using NanoMate.", "Enhanced Cardano (ADA): The Future is bright", "Gavin Andresen on Memo: Censorship-resistant, open-protocol Twitter? Sounds good to me!", "Koinex Becomes FIRST exchange in the world to start XRP pairs,Signups open only for Indians as of now", "Nasdaq May Launch Bitcoin Trading in October 2018", "Cardano Overtakes Litecoin as the #6 Cryptocurrency by Market Cap!", "France Slashes Tax Rate on Cryptocurrency Sales from 45% to 19%", "IOTA + Huawei +Intel soon?", "Cardano (ADA) To Initiate Dual Test Net and Updates by the CEO Hoskinson", "What does TrafficJunky really do - clearing up the misconceptions", "I Quit Smoking. I now use the money saved to buy crypto.", "Michael Parsons, Chairman of Cardano Foundation on BBC World News Live", "VeChain Partnerships - A Detailed List", "CFTC Offers $100,000 Bounty to Crypto Pump-and-Dump Whistleblowers - Bitcoin News", "Ethereum could hit $2,500 by year end, consultancy firm says", "Wanchain: Rebuilding Finance (Overview)", "ICON AND WAN ARE GOING TO FLY!!!!!", "WooCommerce REQ Plugin - 43% of all online shops worldwide can now use REQ as payment", "Intel colllaborating with Fujitsu to integrate #AI and IoT machine vision", "Request Network ????>?\" Partnership with Wikimedia", "BINANCE LISTS GOLEM!", "Erik Voorhees: ????>???Roger - please stop referencing me to back up your opinion that Bitcoin Cash is Bitcoin. It isn't. Bitcoin is the chain originating from the genesis block with the highest accumulated proof of work. The Bitcoin Cash fork failed to gain majority, thus it is not Bitcoin.????>???", "NEO to $1000 and Ontology Network", "$40 Trillion Cryptocurrency Market Cap ????>?EDefinitely Possible????>??: Pantera Capital CEO", "Pantera Capital places largest bet for 2018 on ICON.", "Billion Dollar Crypto Fund, Pantera Capital says, \"single largest bet is on ICON\"", "VeChain Github is Live", "Santander WILL use Xrapid! - Corey", "Their largest investment is Icon ICX says CEO of cryptocurrency hedge fund Pantera Capital Management LP (see also full video :D )", "????>??????>??The definitive list of people you should trust in Crypto.", "\"Of all the papers IOHK Research has written, this one is the most significant [...]PoS has nearly identical properties to PoW. Welcome to the age of Ouroboros Genesis\"", "American Express and LianLian (Ripple partners) accepted into China payments processing by Peoples bank of China", "Nick Szabo retweeted: \"???????? If you are new to #bitcoin then please be aware that bitcoin .com is a fraudulent website. ???????? This website is run by Roger Ver who is a known serial scammer. ???????? The current main scam is the promotion of #bcash which is a fake version of bitcoin.\"", "Charlie Lee Confirms Collaboration with TokenPay to Buy Bank", "Crypto Exchange Binance is More Profitable than Germany????>??s Biggest Bank Deutsche", "17000000 Bitcoins Have Been Mined! 4 millions to go! Happy anniversary day!", "MercuryFX confirming successful xRapid testing and working to move it into production.", "Ripple Grows Its Global Payments Network With Five New xVia Customers", "NANO is back to full functionality on Binance!", "BrainBlocks is back online, and more stable than ever", "Sneak peak at the Blockchain in Action.... THOR", "$OMG - Bithumb listing", "Price drop since MindGeek partnership = Muslim selloff", "Swiss-French Bank adopting Ripple", "Cardano in the Car (Update from Charles Hoskinson)", "Cardano (ADA) Gets Further Into Top 10 Cryptos For All The Right Reasons", "ICON listed on the new UPCOIN Exchange", "Interview w/ Founder...Today", "Lisk Core 1.0.0 Beta Fully Opened! - Members are now able to Forge and Transact!", "After MindGeek deal Verge (XVG) now eyes Spotify adoption", "Nasdaq is open to becoming cryptocurrency exchange, CEO says", "Nasdaq is open to becoming cryptocurrency exchange, CEO says", "After 48 green hours, the correction to $9200 is still considered healthy. Next possible target at $9,800 ????>?' $10,000", "Help Get Xvg Accepted By Spotify", "Freelancers, It's Time To Declare A War Against PayPal. And Choose Cryptocurrencies!", "Bitcoin Private [BTCP] shows a phenomenal breakthrough ????>?' surges by 121%", "Huge Buy Wall", "SAP Just tweeted this article mentioning Ripple on banks collaborating with FinTech firms!", "IOTA Co-Founder buying a drink with the help of a DXC (170K employees) roboter arm paid in IOTAs", "Fujitsu showcases IOTA cryptocurrency as new automation standard", "Cardano ADA Ledger Application 0.1.0", "@YahooFinance just release ????>???The Ultimate Guide to Lisk????>???", "Bitcoin price surges by a third as cryptocurrency breaks above $9,000", "NEO is severely undervalued!", "Finally Binance added button to exchange decimal coins to BNB", "Binance's \"Dust to BNB\" is finally up! No more coins stuck on the exchange.", "IOTA - World First Charging Station - M2M and IoT is Coming!", "Malta is Becoming the Crypto Capital of the World", "TRX will be listed on @coinbene and TRX/USDT will be opened on April 25,14:00 (UTC+8), click poster to know more. ~ TRON !!!", "Cancelled my CitiBank credit card today. Won't bank with someone who's against CryptoCurrency.", "The Icon that is ICX. Analysis / Breakdown / Valuation.", "We????>??re back. $4.00 on Binance!", "It????>??s over 9000!!!!!!", "Bittrex Adds TRX/USDT Pair", "Bittrex just listed USDT-SC", "Fujitsu DE places IOTA on its Twitter bio", "Plenty of coins use the Bitcoin name. If you have a problem with the name Bitcoin Cash it????>??s because something deep inside tells you it might just be the real Bitcoin.", "Bitcoin Cash has risen 80% over the last week...", "Phenomenon of Bitcoin Private", "Early investor in Tesla, Skype and Hotmail says bitcoin will be bigger than all those combined", "Amazon Web Services and IOTA", "Icon (ICX) Launches Blockchain Incubator as Part of New Project", "Bitfinex | EOS Block Producer Candidate", "PayPal Adds $5.99 Fee To International Transfers", "Santander and Ripple - testing was very good", "Reddit has made me lots of money, now I????>??ll give a free tip back", "Ripple's Huge Plans With Santander & Michael Arrington's XRP Crypto Hedge Fund!", "Now That TorGuard Accepts XVG, Lets see If We Can Get Others To Follow!", "Former JP Morgan Banker Says Cryptocurrency Market Will Get Much Bigger", "Bitcoin Cash has risen 80% over the last week", "IOTA is awesome!", "The Cryptocurrency Marketcap is now over $400B ($0.4T)", "NANO (XRB) Releases New Version, Added to Ledger Hardware Wallet Soon", "$HPB Marketing machine is going strong"]}